[
  {
    "id": "hansard-report-thursday-4th-december-2025-e",
    "title": "Hansard Report - Thursday, 4th December 2025 (E)",
    "date": "2025-12-04",
    "document_type": "Hansard",
    "sector": "Security",
    "keywords": [
      "appointment",
      "inquiry",
      "public participation",
      "security",
      "environment"
    ],
    "summary": "I hope today, wherever you rest, you feel proud of the man I am becoming and the service I am stepping into. Deputy Speaker, I beg to move the following Special Motion: THAT, taking into consideration the findings of the Departmental Committee on Labour in its report on the approval hearing of a Nominee for Appointment as the Commission Secretary/Chief Executive Officer of the Salaries and Remuneration Commission, laid on the Table of the House on Thursday, 4th December 2025, and pursuant to provisions of Section 16(1) of the Salaries and Remuneration Commission Act, Cap 412D, and Sections 3 and 8 of the Public Appointments (Parliamentary Approval) Act, Cap 7F, this House approves the appointment of Mr Ali Abdullahi Surraw as the Commission Secretary/Chief Executive Officer of the Salaries and Remuneration Commission. Temporary Speaker, I beg to move the following Motion: THAT, this House adopts the Report of the Departmental Committee on Defence, Intelligence and Foreign Relations on the inquiry into the conduct of the British Army Training Unit in Kenya (BATUK), laid on the Table of the House on Tuesday, 25th November 2025. I also appreciate them on behalf of the women who cannot report to anyone because they will be victimized instead of being given solutions I thank the Committee for standing strong on behalf of Kenyans and representing them, and for going out there to listen to the people. Temporary Speaker, pursuant to the provisions of Standing Order 44(2)(c), I rise to request for a Statement from the Chairperson of the Departmental Committee on Administration and Internal Security regarding the violent disruption of a public participation forum convened by the National Environment Management Authority (NEMA) today, 4th December 2025 in Bushiangala area, Ikolomani Constituency.",
    "risk_flags": [],
    "geographic_scope": "National",
    "source_file": "Hansard Report - Thursday, 4th December 2025 (E).txt"
  },
  {
    "id": "supplementary-order-paper-for-thursday-12th-february-2026-0",
    "title": "SUPPLEMENTARY ORDER PAPER FOR THURSDAY, 12TH FEBRUARY 2026_0",
    "date": null,
    "document_type": "Order Paper",
    "sector": "Finance",
    "keywords": [
      "appointment",
      "finance"
    ],
    "summary": "SPECIAL MOTION– CONSIDERATION OF NOMINEE FOR APPOINTMENT AS THE DIRECTOR GENERAL OF THE FINANCIAL REPORTING CENTRE (The Chairperson, Departmental Committee on Finance and National Planning) THAT, taking into consideration the findings of the Departmental Committee on Finance and National Planning in its report on the approval hearing of a Nominee for Appointment as the Director General of the Financial Reporting Centre, laid on the Table of the House on Wednesday, 11th February 2026, and pursuant to the provisions of section 25 of the Proceeds of Crime and Anti- Money Laundering Act (POCAMLA), Cap 59A and sections 3 & 8 of the Public Appointments (Parliamentary Approval) Act, Cap. THAT, each speech in a debate on any Motion, including a Special motion be limited in the following manner: A maximum of three hours with not more than twenty (20) minutes for the Mover and ten (10) minutes for any other Member speaking, except the Leader of the Majority Party and the Leader of the Minority Party, who shall be limited to a maximum of fifteen (15) minutes each, and that ten (10) minutes before the expiry of the time, the Mover be called upon to reply; and that priority in speaking be accorded to the Leader of the Majority Party, the Leader of the Minority Party and the Chairperson of the relevant Departmental Committee, in that order. THAT, each speech in a debate on Bills NOT sponsored by a Committee, the Leader of the Majority Party or the Leader of the Minority Party be limited as follows: A maximum of three hours and thirty minutes, with not more than thirty (30) minutes for the Mover, in moving and ten (10) minutes in replying, a maximum of thirty (30) minutes for the Chairperson of the relevant Committee and a maximum of ten (10) minutes for any other Member speaking, except the Leader of the Majority Party and the Leader of the Minority Party, who shall be limited to a maximum of fifteen minutes (15) each; and that priority in speaking be accorded to the Leader of the Majority Party, the Leader of the Minority Party and the Chairperson of the relevant Departmental Committee, in that order. THAT, each speech in a debate on Bills sponsored by a Committee, the Leader of the Majority Party or the Leader of the Minority Party be limited as follows:- A maximum of forty five (45) minutes for the Mover, in moving and fifteen minutes (15) in replying, a maximum of thirty (30) minutes for the Chairperson of the relevant Committee (if the Bill is not sponsored by the relevant Committee), and a maximum of ten (10) minutes for any other Member speaking, except the Leader of the Majority Party and the Leader of the Minority Party, who shall be limited to a maximum of fifteen minutes (15) each (if the Bill is not sponsored by either of them); and that priority in speaking be accorded to the Leader of the Majority Party, the Leader of the Minority Party and the Chairperson of the relevant Departmental Committee, in that order. 3 OF 2025 ON PARTIAL DIVESTITURE IN SAFARICOM PLC BY THE GOVERNMENT OF KENYA (The Chairperson, Departmental Committee on Finance and National Planning) (Subject to Tabling of Committee Report and Notice of Motion) ........./Appendix* APPENDIX NOTICE OF PETITIONS, QUESTIONS & STATEMENTS ORDER NO.",
    "risk_flags": [],
    "geographic_scope": "National",
    "source_file": "SUPPLEMENTARY ORDER PAPER FOR THURSDAY, 12TH FEBRUARY 2026_0.txt"
  },
  {
    "id": "the-hansard-tuesday-10-february-2026-6",
    "title": "The Hansard - Tuesday, 10 February 2026_6",
    "date": "2026-02-10",
    "document_type": "Hansard",
    "sector": "General Governance",
    "keywords": [
      "fund"
    ],
    "summary": "JOSEPH HAMISI DENAR Before I conclude, it is with profound sorrow that I remind the House of the untimely demise of our esteemed colleague, the late Hon. When we broke for the recess, we all thought that we would go and have our beautiful Christmas and new year and then see each other in January, but that was not so for our colleague, Hon. Speaker: On the National Government Constituencies Development Fund (NG- CDF), I have been requested by Senior Counsel Otiende Amollo and Hon. I also congratulate the legislative caucus team, our team of lawyers in the National Assembly and those who supported us from outside Parliament, for the great work that they did in saving NG-CDF from assault by those who do not understand its value to Kenyans and not to Members of Parliament. 10th February 2026 National Assembly Debates 19 Published by Clerk of the National Assembly Parliament Buildings NAIROBI Disclaimer: The electronic version of the Official Hansard Report is for information purposes only.",
    "risk_flags": [],
    "geographic_scope": "National",
    "source_file": "The Hansard - Tuesday, 10 February 2026_6.txt"
  },
  {
    "id": "the-hansard-wednesday-11-february-2026-a-0",
    "title": "The Hansard - Wednesday, 11 February 2026 (A)_0",
    "date": "2026-02-11",
    "document_type": "Hansard",
    "sector": "Security",
    "keywords": [
      "security"
    ],
    "summary": "Deputy Speaker, I beg to move the following Procedural Motion: THAT, pursuant to the provisions of Standing Order 97(1), this House orders that each speech in a debate on Bills sponsored by a Committee, the Leader of the Majority Party or the Leader of the Minority Party be limited as follows: A maximum of 45 minutes for the mover in moving and 15 minutes in replying, a maximum of 30 minutes for the Chairperson of the relevant Committee (if the Bill is not sponsored by the relevant Committee), and a maximum of 10 minutes for any other Member speaking, except the Leader of the Majority Party and the Leader of the Minority Party, who shall be limited to a maximum of 15 minutes each (if the Bill is not sponsored by either of them); and that priority in speaking be accorded to the Leader of the Majority Party, the Leader of the Minority Party and the Chairperson of the relevant Departmental Committee, in that order. Deputy Speaker, I beg to move the following Procedural Motion: THAT, pursuant to the provisions of Standing Order 97(1), this House orders that each speech in a debate on Bills NOT sponsored by a Committee, the Leader of the Majority Party or the Leader of the Minority Party be limited as follows: A maximum of three hours and 30 minutes, with not more than 30 minutes for the mover in moving and 10 minutes in replying, a maximum of 30 minutes for the Chairperson of the relevant Committee and a maximum of 10 minutes for any other Member speaking, Disclaimer: The electronic version of the Official Hansard Report is for information purposes only. Deputy Speaker, I beg to move the following Procedural Motion: THAT, pursuant to the provisions of Standing Order 97(1), this House orders that each speech in a debate on any Motion, including a Special Motion be limited in the following manner: A maximum of three hours with not more than 20 minutes for the mover and 10 minutes for any other Member speaking, except the Leader of the Majority Party and the Leader of the Minority Party, who shall be limited to a maximum of 15 minutes each, and that 10 minutes before the expiry of the time, the mover shall be called upon to reply; and that priority in speaking be accorded to the Leader of the Majority Party, the Leader of the Minority Party and the Chairperson of the relevant Departmental Committee, in that order. Deputy Speaker, I beg to move the following Motion: THAT, pursuant to the provisions of Standing Order 97(1), this House orders that each speech in a debate on Other Committee Reports, including a Report of a Joint Committee of the Houses of Parliament or any other Report submitted to the House for which limitation of time has not been specified, shall be limited as follows: A maximum of two and a half hours, with not more than twenty (20) minutes for the Mover in moving and five (5) minutes for any other Member speaking, including the Leader of the Majority Party and the Leader of the Minority Party and the Chairperson of the relevant Committee (if the Committee Report is not moved by the Chairperson of the relevant Committee), and that ten (10) minutes before the expiry of the time, the Mover shall be called upon to reply; and further that priority in speaking shall be accorded to the Leader of the Majority Party and the Leader of the Minority Party, in that order. Deputy Speaker, I beg to move: THAT, noting that Standing Order 24(6) provides that debate on a Motion on the Address by the President shall be limited to not more than four sitting days; and pursuant to the provisions of Standing Order 97(1), this House orders that debate on a Motion on the Address by His Excellency the President under Article 132(1)(a) of the Constitution shall be limited as follows: A maximum of 30 minutes for the Mover in moving, 20 minutes for the Leader of the Minority Party, and 10 minutes each to the Chairperson of the Departmental Committee on Justice and Legal Affairs to speak on the report submitted under Article 132(1)(c)(i) of the Constitution relating to the realisation of the national values; the Chairperson of the Departmental Committee on Defence, Intelligence & Foreign Relations to speak on the report submitted under Article 132(1)(c)(iii) of the Constitution relating to the progress made in fulfilling the international obligations of the Republic; and the Chairperson of the Departmental Committee on Administration & Internal Security to speak on the report submitted under Article 240(7) of the Constitution relating to the state of the security of the Country; and five minutes for any other Member speaking, and that 10 minutes before the expiry of the time, the Mover shall be called upon to reply.",
    "risk_flags": [],
    "geographic_scope": "National",
    "source_file": "The Hansard - Wednesday, 11 February 2026 (A)_0.txt"
  }
]
